testCase/0/ph_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    entrainment
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    walls
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    burner
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    grass
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    tunnel
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    "front|back"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
