testCase/constant/reactions
species
(
    O2
    H2O
    SURROGATE
    CO2
    N2
);

reactions
{
    MethanolReaction
    {
        type irreversibleinfiniteReaction;
        reaction "SURROGATE + 3.7O2 + 13.91N2 = 3.4CO2 + 3.1H2O + 13.91N2";
    }
}
