testCase/constant/turbulenceProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES; 

LES{

LESModel	WALE;//dynamicKEqn;

delta           cubeRootVol;

turbulence      on;

printCoeffs     on;

dynamicKEqnCoeffs
{
	filter	simple;	
	Prt 0.5;
}

cubeRootVolCoeffs
{
        deltaCoeff      1;
}

kEqnCoeffs
{
    	Ce              1.048;
        Ck              0.094;
}

dynamicKEqnCoeffs
{
	filter	simple;
}

SmagorinskyCoeffs
{
    	Ce              1.048;
    	Ck              0.094;
}

WALECoeffs
{
    Ck              0.094;
    Cw              0.55;
}

}



// ************************************************************************* //
