testCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     PBMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         270;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   5.0;

//purgeWrite      30;

writeFormat     ascii;
//writeFormat     binary;

writePrecision  6;

//writeCompression compressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.75;

//maxDeltaT       0.01;

libs (
"libEDM.so"
);

functions
{
	#include "volFields"
	#include "gasProbes"
};
