testCase/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 200;

method          hierarchical;

hierarchicalCoeffs
{
    n               ( 20 1 10 );
    delta           0.001;
    order           xyz;
}

simpleCoeffs
{
    n               ( 7 5 4 );
    delta           0.001;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}

metisCoeffs
{
}


// ************************************************************************* //
