testCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    };

    p_rgh
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0.0;
        smoother            GaussSeidel;
    };

    p_rghFinal
    {
        $p_rgh;
        tolerance           1e-7;
        relTol              0;
    };

    ph_rgh
    {
        $p_rgh;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0;
        nSweeps         1;
    };

    UFinal
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0;
        nSweeps         1;
    };

    "Yi.*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0;
        nSweeps         1;
    };

    "k.*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0;
        nSweeps         1;
    };

    "h|hFinal|hth_ad|hth_adFinal|hth_m|hth_mFinal"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0;
        nSweeps         1;
    };

    Ii
    {
/*
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-04;
        relTol          0;
	maxIter		100;
*/
        solver                  GAMG;
        tolerance               1e-4;
        relTol                  0;
        smoother                DILU;
	maxIter			20;	
    }

    G
    {
	    solver          PCG;
	    preconditioner  DIC;
	    tolerance       1e-03;
	    relTol          0;
    }
}

MULES
{
    bMULES	no;//yes;
    bHsMULES	no;//yes;
}

PIMPLE
{
	momentumPredictor yes;
	nOuterCorrectors  8;
	nCorrectors       2;
	nNonOrthogonalCorrectors 0;

    	hydrostaticInitialization yes;
    	nHydrostaticCorrectors 5;

    residualControl
    {
        U
        {
                tolerance  5e-5;
                relTol      0;
        }
        p
        {
                tolerance  5e-5;
                relTol      0;
        }
     }
}

relaxationFactors
{

}


// ************************************************************************* //
