testCase/system/gasProbes
gasProbes
{
type probes;
functionObjectLibs ("libsampling.so");
type            probes;
outputControl   timeStep;
outputInterval  10;
interpolationScheme cellPointFace;

probeLocations
(
(	40		0		0	)
(	40		0.2		0	)
(	40		0.4		0	)
(	40		0		0.5	)
(	40		0.2		0.5	)
(	40		0.4		0.5	)
(	40		0		1.0	)
(	40		0.2		1.0	)
(	40		0.4		1.0	)
(	42		0		0	)
(	42		0.2		0	)
(	42		0.4		0	)
(	42		0		0.5	)
(	42		0.2		0.5	)
(	42		0.4		0.5	)
(	42		0		1.0	)
(	42		0.2		1.0	)
(	42		0.4		1.0	)
(	44		0		0	)
(	44		0.2		0	)
(	44		0.4		0	)
(	44		0		0.5	)
(	44		0.2		0.5	)
(	44		0.4		0.5	)
(	44		0		1.0	)
(	44		0.2		1.0	)
(	44		0.4		1.0	)
);

fields
(
	T magU G_projected O2 p
);
}
