testCase/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}

castellatedMesh   true; //or false to de-activate
snap              true;
addLayers         true;

geometry
{
	region1 
	{
		type searchableBox;          
		min     (-1000 0 -1000);
		max     (1000 0.8 1000);    
	}

	region2 
	{
		type searchableBox;          
		min     (-1000 0.8 -1000);
		max     (1000 3.0 1000);    
	}

	region3
	{
		type searchableBox;          
		min     (-1000 3.0 -1000);
		max     (1000 10.0 1000);    
	}
}



castellatedMeshControls
{
        features
        (
        );
        refinementSurfaces
        {
        }

		refinementRegions
		{
			region1
			{
				mode inside;
				levels ((1E15 3));         
			}

			region2
			{
				mode inside;
				levels ((1E15 2));         
			}
			region3
			{
				mode inside;
				levels ((1E15 1));         
			}
		}

        locationInMesh ( 0.05 0.05 0.05 );
        maxLocalCells 10000000;
        maxGlobalCells 200000000;
        minRefinementCells 0;
        nCellsBetweenLevels 5;
        resolveFeatureAngle 80.0;
        allowFreeStandingZoneFaces true;
        planarAngle 30.0;
        maxLoadUnbalance 0.1;
    }

meshQualityControls
{
        maxNonOrtho 30.0;
        maxBoundarySkewness 20;
        maxInternalSkewness 4;
        maxConcave 80.0;
        minFlatness 0.5;
        minVol 1.0E-13;
        minTetQuality 1.0E-15;
        minArea -1.0;
        minTwist 0.02;
        minDeterminant 0.001;
        minFaceWeight 0.05;
        minVolRatio 0.01;
        minTriangleTwist -1.0;
        nSmoothScale 4;
        errorReduction 0.75;
        relaxed
        {
            maxNonOrtho 75;
        }
}


snapControls
{
        nSolveIter 30;
        nSmoothPatch 5;
        tolerance 2.0;
        nRelaxIter 5;
        nFeatureSnapIter 15;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
}

addLayersControls
{
        layers
        {
        }

        relativeSizes true;
        expansionRatio 1.0;
        finalLayerThickness 0.3;
        minThickness 0.25;
        nGrow 0;
        featureAngle 130.0;
        slipFeatureAngle 30.0;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
}

mergeTolerance 1.0E-6;